package com.zhangbin.paint.beans;

/**
 * @ClassName EnumOder
 * @Description TODO
 * @Author yangjie
 * @Date 2019/3/20 上午11:44
 */
public enum EnumOder {
    //窗口变化大小
    O_300(300),
    //设置选择
    O_301(301),
    //设置画笔
    O_302(302),
    //设置橡皮
    O_303(303),
    //设置文字
    O_304(304),
    //设置画笔粗细
    O_305(305),
    //设置画笔颜色
    O_306(306),
    //设置橡皮大小
    O_307(307),
    //设置文字字号
    O_308(308),
    //设置文字颜色
    O_309(309),


    //画笔轨迹
    O_400(400),
    //橡皮轨迹
    O_401(401),
    //增加文本
    O_402(402),
    //编辑文本
    O_403(403),
    //移动文本
    O_404(404),
    //直线
    O_405(405),
    //undo
    O_406(406),
    //矩形
    O_407(407),
    //椭圆
    O_408(408),
    //形状移动
    O_409(409),
    //打开草稿纸
    O_410(410),
    //关闭草稿纸
    O_411(411),
    //草稿纸切换页码
    O_412(412),
    //草稿纸切换背景
    O_413(413),
    //增加草稿纸
    O_414(414),

    //清除
    O_500(500),
    //撤销
    O_501(501),
    //恢复
    O_502(502),
    //翻页
    O_503(503),
    //上一步
    O_504(504),
    //下一步
    O_505(505),

    ;
    private int v;

    EnumOder(int i) {
        this.v = i;
    }

}
